-- k8s cluster attachment add data disk setting `mount_target` , `file_system`, `auto_format_and_mount`

```
 terraform apply
2021/01/21 18:44:48 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
data.tencentcloud_instance_types.default: Refreshing state...
data.tencentcloud_vpc_subnets.vpc: Refreshing state...
data.tencentcloud_images.default: Refreshing state...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_instance.foo will be created
  + resource "tencentcloud_instance" "foo" {
      + allocate_public_ip                      = false
      + availability_zone                       = "ap-guangzhou-3"
      + create_time                             = (known after apply)
      + disable_monitor_service                 = false
      + disable_security_service                = false
      + expired_time                            = (known after apply)
      + force_delete                            = false
      + id                                      = (known after apply)
      + image_id                                = "img-25szkc8t"
      + instance_charge_type                    = "POSTPAID_BY_HOUR"
      + instance_charge_type_prepaid_renew_flag = (known after apply)
      + instance_name                           = "tf-auto-test-1-1"
      + instance_status                         = (known after apply)
      + instance_type                           = "S1.SMALL1"
      + internet_charge_type                    = (known after apply)
      + internet_max_bandwidth_out              = (known after apply)
      + key_name                                = (known after apply)
      + private_ip                              = (known after apply)
      + project_id                              = 0
      + public_ip                               = (known after apply)
      + running_flag                            = true
      + security_groups                         = (known after apply)
      + subnet_id                               = "subnet-1uwh63so"
      + system_disk_id                          = (known after apply)
      + system_disk_size                        = 50
      + system_disk_type                        = "CLOUD_PREMIUM"
      + vpc_id                                  = "vpc-h70b6b49"

      + data_disks {
          + data_disk_id           = (known after apply)
          + data_disk_size         = (known after apply)
          + data_disk_snapshot_id  = (known after apply)
          + data_disk_type         = (known after apply)
          + delete_with_instance   = (known after apply)
          + encrypt                = (known after apply)
          + throughput_performance = (known after apply)
        }
    }

  # tencentcloud_kubernetes_cluster.managed_cluster will be created
  + resource "tencentcloud_kubernetes_cluster" "managed_cluster" {
      + certification_authority      = (known after apply)
      + claim_expired_seconds        = 300
      + cluster_as_enabled           = false
      + cluster_cidr                 = "10.1.0.0/16"
      + cluster_deploy_type          = "MANAGED_CLUSTER"
      + cluster_desc                 = "test cluster desc"
      + cluster_external_endpoint    = (known after apply)
      + cluster_internet             = false
      + cluster_intranet             = false
      + cluster_ipvs                 = true
      + cluster_max_pod_num          = 32
      + cluster_max_service_num      = 32
      + cluster_name                 = "keep"
      + cluster_node_num             = (known after apply)
      + cluster_os                   = "ubuntu16.04.1 LTSx86_64"
      + cluster_os_type              = "GENERAL"
      + cluster_version              = "1.10.5"
      + container_runtime            = "docker"
      + deletion_protection          = false
      + domain                       = (known after apply)
      + id                           = (known after apply)
      + ignore_cluster_cidr_conflict = false
      + is_non_static_ip_mode        = false
      + kube_config                  = (known after apply)
      + network_type                 = "GR"
      + node_name_type               = "lan-ip"
      + password                     = (known after apply)
      + pgw_endpoint                 = (known after apply)
      + security_policy              = (known after apply)
      + user_name                    = (known after apply)
      + vpc_id                       = "vpc-h70b6b49"
      + worker_instances_list        = (known after apply)

      + worker_config {
          + availability_zone                       = "ap-guangzhou-3"
          + count                                   = 1
          + enhanced_monitor_service                = false
          + enhanced_security_service               = false
          + instance_charge_type                    = "POSTPAID_BY_HOUR"
          + instance_charge_type_prepaid_period     = 1
          + instance_charge_type_prepaid_renew_flag = "NOTIFY_AND_MANUAL_RENEW"
          + instance_name                           = "sub machine of tke"
          + instance_type                           = "S1.SMALL1"
          + internet_charge_type                    = "TRAFFIC_POSTPAID_BY_HOUR"
          + internet_max_bandwidth_out              = 100
          + password                                = (sensitive value)
          + public_ip_assigned                      = true
          + subnet_id                               = "subnet-1uwh63so"
          + system_disk_size                        = 60
          + system_disk_type                        = "CLOUD_SSD"
          + user_data                               = "dGVzdA=="

          + data_disk {
              + disk_size = 50
              + disk_type = "CLOUD_PREMIUM"
            }
        }
    }

  # tencentcloud_kubernetes_cluster_attachment.test_attach will be created
  + resource "tencentcloud_kubernetes_cluster_attachment" "test_attach" {
      + cluster_id      = (known after apply)
      + id              = (known after apply)
      + instance_id     = (known after apply)
      + labels          = {
          + "test1" = "test1"
          + "test2" = "test2"
        }
      + password        = (sensitive value)
      + security_groups = (known after apply)

      + worker_config {
          + docker_graph_path = "/var/lib/docker"
          + is_schedule       = true

          + data_disk {
              + auto_format_and_mount = true
              + disk_size             = 50
              + disk_type             = "CLOUD_PREMIUM"
              + file_system           = "ext3"
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

tencentcloud_instance.foo: Creating...
tencentcloud_kubernetes_cluster.managed_cluster: Creating...
tencentcloud_instance.foo: Still creating... [10s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [10s elapsed]
tencentcloud_instance.foo: Creation complete after 20s [id=ins-hrv2n0dm]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [20s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [30s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [40s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [50s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [1m0s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [1m10s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [1m20s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [1m30s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [1m40s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [1m50s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [2m0s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [2m10s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [2m20s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [2m30s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [2m40s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [2m50s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [3m0s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [3m11s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [3m21s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [3m31s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [3m41s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [3m51s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [4m1s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [4m11s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [4m21s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [4m31s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [4m41s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [4m51s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [5m1s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [5m11s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [5m21s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [5m31s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [5m41s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [5m51s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [6m1s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Still creating... [6m11s elapsed]
tencentcloud_kubernetes_cluster.managed_cluster: Creation complete after 6m12s [id=cls-8wzpvrx2]
tencentcloud_kubernetes_cluster_attachment.test_attach: Creating...
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [10s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [20s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [30s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [40s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [50s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [1m0s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [1m10s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [1m20s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [1m30s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [1m40s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [1m50s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [2m0s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [2m10s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [2m20s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [2m30s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [2m40s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Creation complete after 2m40s [id=ins-hrv2n0dm_cls-8wzpvrx2]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```